/*
Задача 6: Напишите программу, которая на вход принимает число 
и выдаёт, является ли число чётным (делится ли оно на два без остатка).
*/
Console.WriteLine("Укажите чесло которое нужно проверить на чётность");
int Num = Convert.ToInt32(Console.ReadLine());

if (Num % 2 == 1) Console.WriteLine("Оооо NoY");

else Console.WriteLine("YeеееS");






